RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_rdcm.c
        /* configure excitor output enable */
        RDCM_CTL |= (exc_outputpara->exc_en & RDCM_CTL_EXCEN);
    }
}

/*!
    \brief      initialize RDCM excitor pwm parameter struct with a default value (API_ID(0x0006U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void rdcm_pwm_parameter_struct_para_init(rdcm_pwm_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x0006U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->pwm_en      = RDCM_PWM_DISABLE;
        initpara->bit_reverse = RDCM_BREVM_NORMAL;
        initpara->pwm_gain    = 0U;
        initpara->pwm_offset  = 0U;
    }
}

/*!
    \brief      configure RDCM excitor pwm function (API_ID(0x0007U))
    \param[in]  pwm_para: RDCM pwm parameter struct
                pwm_en: RDCM_PWM_ENABLE, RDCM_PWM_DISABLE
                bit_reverse: RDCM_BREVM_NORMAL, RDCM_BREVM_BIT_REVERSED
                pwm_offset: PWM offset for PWM value, 0~0x3FFF
                pwm_gain: PWM gain for PWM value, 0~0x3FFF
    \param[out] none
    \retval     none
*/
void rdcm_excitor_pwm_config(rdcm_pwm_parameter_struct *pwm_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(pwm_para)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x0007U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable pwm output */
        RDCM_PWMCFG &= (~RDCM_PWMCFG_PWMEN);

        /* configure pwm bit-reversed mode */
        RDCM_PWMCFG &= (~RDCM_PWMCFG_BREVM);
        RDCM_PWMCFG |= (pwm_para->bit_reverse & RDCM_PWMCFG_BREVM);

        /* configure pwm offset and gain */
        RDCM_PWMCFG &= (~(RDCM_PWMCFG_PWMOFFSET | RDCM_PWMCFG_PWMGAIN));
        RDCM_PWMCFG |= ((pwm_para->pwm_gain & RDCM_PWMCFG_PWMGAIN) | ((pwm_para->pwm_offset << 16U) & RDCM_PWMCFG_PWMOFFSET));

        /* configure pwm output enable */
        RDCM_PWMCFG |= (pwm_para->pwm_en & RDCM_PWMCFG_PWMEN);
    }
}

/*!
    \brief      initialize RDCM reference frequency mixer parameter struct with a default value (API_ID(0x0008U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void rdcm_rfm_parameter_struct_para_init(rdcm_rfm_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->i_rfm_en    = RDCM_RFM_DISABLE;
        initpara->i_zc_mode   = RDCM_IZCDMS_DISABLE;
        initpara->i_hf_mode   = 0U;
        initpara->i_rfm_fre   = 0U;
        initpara->i_rfm_phase = 0U;
        initpara->i_zc_th     = 0U;
        initpara->i_zc_th_var = 0U;
        initpara->i_average   = 0U;
        initpara->q_rfm_en    = RDCM_RFM_DISABLE;
        initpara->q_zc_mode   = RDCM_QZCDMS_DISABLE;
        initpara->q_hf_mode   = 0U;
        initpara->q_rfm_fre   = 0U;
        initpara->q_rfm_phase = 0U;
        initpara->q_zc_th     = 0U;
        initpara->q_zc_th_var = 0U;
        initpara->q_average   = 0U;
    }
}

/*!
    \brief      configure RDCM reference frequency mixer function (API_ID(0x0009U))
    \param[in]  rfm_para: RDCM reference frequency mixer parameter struct
                i_rfm_en: RDCM_RFM_DISABLE, RDCM_RFM_ENABLE
                i_zc_mode: RDCM_IZCDMS_DISABLE, RDCM_IZCDMS_POSITIVE, RDCM_IZCDMS_NEGATIVE, RDCM_IZCDMS_BOTH
                i_hf_mode: RDCM_IHFM_DISABLE, RDCM_IHFM_RATEn, n = 1~7
                i_rfm_fre: the frequency control word of the I channel reference frequency mixer, 0~0x3FFF
                i_rfm_phase: initial phase of the I channel reference frequency mixer, 0~0x3FFF
                i_zc_th: the threshold of mismatch counter value in zero crossing detection, 0~0x3FFF
                i_zc_th_var: the threshold variation range of mismatch counter value in zero crossing detection, 0~0x3FFF
                i_average: the mismatch counter average factor, 0~0xF
                q_rfm_en: RDCM_RFM_DISABLE, RDCM_RFM_ENABLE
                q_zc_mode: RDCM_QZCDMS_DISABLE, RDCM_QZCDMS_POSITIVE, RDCM_QZCDMS_NEGATIVE, RDCM_QZCDMS_BOTH
                q_hf_mode: RDCM_QHFM_DISABLE, RDCM_QHFM_RATEn, n = 1~7
                q_rfm_fre: the frequency control word of the Q channel reference frequency mixer, 0~0x3FFF
                q_rfm_phase: initial phase of the Q channel reference frequency mixer, 0~0x3FFF
                q_zc_th: the threshold of mismatch counter value in zero crossing detection, 0~0x3FFF
                q_zc_th_var: the threshold variation range of mismatch counter value in zero crossing detection, 0~0x3FFF
                q_average: the mismatch counter average factor, 0~0xF
    \param[out] none
    \retval     none
*/
void rdcm_reference_frequency_mixer_config(rdcm_rfm_parameter_struct *rfm_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(rfm_para)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* I channel configuration */
        /* disable reference frequency mixer */
        RDCM_CTL &= (~RDCM_CTL_IRFMEN);

        /* zero crossing detection mode selection */
        RDCM_CTL &= (~RDCM_CTL_IZCDMS);
        RDCM_CTL |= ((rfm_para->i_zc_mode) & RDCM_CTL_IZCDMS);

        /* high pass filter mode selection */
        RDCM_HFCFG0 &= (~RDCM_HFCFG0_IHFM);
        RDCM_HFCFG0 |= ((rfm_para->i_hf_mode) & RDCM_HFCFG0_IHFM);

        /* reference frequency mixer frequency and initial phase */
        RDCM_RFMCFG0 &= (~RDCM_RFMCFG0_IFRE);
        RDCM_RFMCFG0 |= ((rfm_para->i_rfm_fre << 16U) & RDCM_RFMCFG0_IFRE);
        RDCM_RFMCFG0 &= (~RDCM_RFMCFG0_IPHASE);
        RDCM_RFMCFG0 |= (rfm_para->i_rfm_phase & RDCM_RFMCFG0_IPHASE);

