RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_rdcm.c
        /* zero crossing detection threshold and variation range */
        RDCM_ZTCFG0 &= (~RDCM_ZTCFG0_IZCTH);
        RDCM_ZTCFG0 |= (rfm_para->i_zc_th & RDCM_ZTCFG0_IZCTH);
        RDCM_ZTCFG1 &= (~RDCM_ZTCFG1_IZTVAR);
        RDCM_ZTCFG1 |= (rfm_para->i_zc_th_var & RDCM_ZTCFG1_IZTVAR);

        /* mismatch counter average factor */
        RDCM_MCACFG &= (~RDCM_MCACFG_IAVEM);
        RDCM_MCACFG |= (rfm_para->i_average & RDCM_MCACFG_IAVEM);

        /* Q channel configuration */
        /* disable reference frequency mixer */
        RDCM_CTL &= (~RDCM_CTL_QRFMEN);

        /* zero crossing detection mode selection */
        RDCM_CTL &= (~RDCM_CTL_QZCDMS);
        RDCM_CTL |= ((rfm_para->q_zc_mode) & RDCM_CTL_QZCDMS);

        /* high pass filter mode selection */
        RDCM_HFCFG1 &= (~RDCM_HFCFG1_QHFM);
        RDCM_HFCFG1 |= ((rfm_para->q_hf_mode)& RDCM_HFCFG1_QHFM);

        /* reference frequency mixer frequency and initial phase */
        RDCM_RFMCFG1 &= (~RDCM_RFMCFG1_QFRE);
        RDCM_RFMCFG1 |= ((rfm_para->q_rfm_fre << 16U) & RDCM_RFMCFG1_QFRE);
        RDCM_RFMCFG1 &= (~RDCM_RFMCFG1_QPHASE);
        RDCM_RFMCFG1 |= (rfm_para->q_rfm_phase & RDCM_RFMCFG1_QPHASE);

        /* zero crossing detection threshold and variation range */
        RDCM_ZTCFG0 &= (~RDCM_ZTCFG0_QZCTH);
        RDCM_ZTCFG0 |= ((rfm_para->q_zc_th << 16U) & RDCM_ZTCFG0_QZCTH);
        RDCM_ZTCFG1 &= (~RDCM_ZTCFG1_QZTVAR);
        RDCM_ZTCFG1 |= ((rfm_para->q_zc_th_var << 16U) & RDCM_ZTCFG1_QZTVAR);

        /* mismatch counter average factor */
        RDCM_MCACFG &= (~RDCM_MCACFG_QAVEM);
        RDCM_MCACFG |= ((rfm_para->q_average << 16U) & RDCM_MCACFG_QAVEM);

        /* configure reference frequency mixer enable */
        RDCM_CTL |= (rfm_para->i_rfm_en & RDCM_CTL_IRFMEN);
        RDCM_CTL |= ((rfm_para->q_rfm_en << 16U) & RDCM_CTL_QRFMEN);
    }
}

/*!
    \brief      initialize RDCM demodulator parameter struct with a default value (API_ID(0x000AU))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void rdcm_demodulator_parameter_struct_para_init(rdcm_demodulator_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->i_dem_en     = RDCM_DEM_DISABLE;
        initpara->i_fir0_en    = RDCM_FIR0_DISABLE;
        initpara->i_fir1_en    = RDCM_FIR1_DISABLE;
        initpara->i_fir1_dec   = RDCM_FIR1_DEC_2;
        initpara->i_cic3_en    = RDCM_CIC3_DISABLE;
        initpara->i_cic3_shift = 0U;
        initpara->i_cic3_gain  = 0x1000U;
        initpara->i_cic3_dec   = 0U;
        initpara->i_cic3_val   = 0U;
        initpara->q_dem_en     = RDCM_DEM_DISABLE;
        initpara->q_fir0_en    = RDCM_FIR0_DISABLE;
        initpara->q_fir1_en    = RDCM_FIR1_DISABLE;
        initpara->q_fir1_dec   = RDCM_FIR1_DEC_2;
        initpara->q_cic3_en    = RDCM_CIC3_DISABLE;
        initpara->q_cic3_shift = 0U;
        initpara->q_cic3_gain  = 0x1000U;
        initpara->q_cic3_dec   = 0U;
        initpara->q_cic3_val   = 0U;
    }
}

/*!
    \brief      configure RDCM demodulator function (API_ID(0x000BU))
    \param[in]  dem_para: RDCM demodulator parameter struct
                i_dem_en: RDCM_DEM_DISABLE, RDCM_DEM_ENABLE
                i_fir0_en: RDCM_FIR0_DISABLE, RDCM_FIR0_ENABLE
                i_fir1_en: RDCM_FIR1_DISABLE, RDCM_FIR1_ENABLE
                i_fir1_dec: RDCM_FIR1_DEC_2, RDCM_FIR1_DEC_1
                i_cic3_en: RDCM_CIC3_DISABLE, RDCM_CIC3_ENABLE
                i_cic3_shift: I channel output shift, 0~0x29
                i_cic3_gain: I channel gain factor, 0~0x1FFF
                i_cic3_dec: I channel CIC filter decimation factor, 0~0x1FF
                i_cic3_val: I channel CIC filter start value, 0~0x1FF
                q_dem_en: RDCM_DEM_DISABLE, RDCM_DEM_ENABLE
                q_fir0_en: RDCM_FIR0_DISABLE, RDCM_FIR0_ENABLE
                q_fir1_en: RDCM_FIR1_DISABLE, RDCM_FIR1_ENABLE
                q_fir1_dec: RDCM_FIR1_DEC_2, RDCM_FIR1_DEC_1
                q_cic3_en: RDCM_CIC3_DISABLE, RDCM_CIC3_ENABLE
                q_cic3_shift: Q channel output shift, 0~0x29
                q_cic3_gain: Q channel gain factor, 0~0x1FFF
                q_cic3_dec: Q channel CIC filter decimation factor, 0~0x1FF
                q_cic3_val: Q channel CIC filter start value, 0~0x1FF
    \param[out] none
    \retval     none
*/
void rdcm_demodulator_config(rdcm_demodulator_parameter_struct *dem_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(dem_para)) {
        fw_debug_report_err(RDCM_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* I channel configuration */
        /* disable demodulator */
        RDCM_CTL &= (~RDCM_CTL_IDEMEN);

        /* disable filter */
        RDCM_DEMCFG &= (~(RDCM_DEMCFG_IFIR0EN | RDCM_DEMCFG_IFIR1EN | RDCM_DEMCFG_ICIC3EN));

        /* FIR1 decimation rate configuration */
        RDCM_DEMCFG &= (~RDCM_DEMCFG_IFIR1DEC);
        RDCM_DEMCFG |= (dem_para->i_fir1_dec & RDCM_DEMCFG_IFIR1DEC);

        /* CIC3 filter decimation rate and start value configuration */
        RDCM_CICCFG0 &= (~RDCM_CICCFG0_ICICDFAC);
        RDCM_CICCFG0 |= (dem_para->i_cic3_dec & RDCM_CICCFG0_ICICDFAC);
        RDCM_CICCFG0 &= (~RDCM_CICCFG0_ICICSVAL);
        RDCM_CICCFG0 |= ((dem_para->i_cic3_val << 16U) & RDCM_CICCFG0_ICICSVAL);

        /* CIC3 filter output shift and gain factor configuration */
        RDCM_CSGCFG0 &= (~RDCM_CSGCFG0_IGAIN);
        RDCM_CSGCFG0 |= (dem_para->i_cic3_gain & RDCM_CSGCFG0_IGAIN);
        RDCM_CSGCFG0 &= (~RDCM_CSGCFG0_ICICSHIFT);
        RDCM_CSGCFG0 |= ((dem_para->i_cic3_shift << 16U) & RDCM_CSGCFG0_ICICSHIFT);

        /* Q channel configuration */
        /* disable demodulator */
        RDCM_CTL &= (~RDCM_CTL_QDEMEN);

        /* disable filter  */
        RDCM_DEMCFG &= (~(RDCM_DEMCFG_QFIR0EN | RDCM_DEMCFG_QFIR1EN | RDCM_DEMCFG_QCIC3EN));

