RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_rdcm.c
    }
}

/*!
    \brief      enable timestamp counter capture (API_ID(0x001FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_timestamp_counter_capture_enable(void)
{
    RDCM_CTL |= RDCM_CTL_TSCAPEN;
}

/*!
    \brief      disable timestamp counter capture (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_timestamp_counter_capture_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_TSCAPEN);
}

/*!
    \brief      configure timestamp trigger mode (API_ID(0x0021U))
    \param[in]  mode: external trigger mode
      \arg        RDCM_TSCAPETM_DISABLE: disable trigger for timestamp counter capture
      \arg        RDCM_TSCAPETM_RISING : rising edge of external trigger for timestamp counter capture
      \arg        RDCM_TSCAPETM_FALLING: falling edge of external trigger for timestamp counter capture
      \arg        RDCM_TSCAPETM_BOTH   : rising and falling edge of external trigger for timestamp counter capture
    \param[out] none
    \retval     none
*/
void rdcm_timestamp_trigger_mode_config(uint32_t mode)
{
    RDCM_CTL &= (~RDCM_CTL_TSCAPETM);
    RDCM_CTL |= (mode & RDCM_CTL_TSCAPETM);
}

/*!
    \brief      configure timestamp counter clock (API_ID(0x0022U))
    \param[in]  clock: timestamp counter clock
      \arg        RDCM_TSCLK_DIV1: fTS = fRDCM
      \arg        RDCM_TSCLK_DIV2: fTS = fRDCM / 2
      \arg        RDCM_TSCLK_DIV4: fTS = fRDCM / 4
      \arg        RDCM_TSCLK_DIV8: fTS = fRDCM / 8
    \param[out] none
    \retval     none
*/
void rdcm_timestamp_counter_clock_config(uint32_t clock)
{
    RDCM_TSCTL &= (~RDCM_TSCTL_TSCLK);
    RDCM_TSCTL |= (clock & RDCM_TSCTL_TSCLK);
}

/*!
    \brief      enable result data fifo (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_result_data_fifo_enable(void)
{
    RDCM_CTL |= RDCM_CTL_FIFOEN;
}

/*!
    \brief      disable result data fifo (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_result_data_fifo_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_FIFOEN);
}

/*!
    \brief      configure FIFO result event (API_ID(0x0025U))
    \param[in]  event: FIFO result event
      \arg        RDCM_FIFOESEL_1VALUE: generate result data event when FIFO contains 1 value
      \arg        RDCM_FIFOESEL_2VALUE: generate result data event when FIFO contains 2 values
      \arg        RDCM_FIFOESEL_3VALUE: generate result data event when FIFO contains 3 values
      \arg        RDCM_FIFOESEL_4VALUE: generate result data event when FIFO contains 4 values
    \param[out] none
    \retval     none
*/
void rdcm_fifo_result_event_config(uint32_t event)
{
    RDCM_FIFOCS &= (~RDCM_FIFOCS_FIFOESEL);
    RDCM_FIFOCS |= (event & RDCM_FIFOCS_FIFOESEL);
}

/*!
    \brief      flush result data fifo (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_result_data_fifo_flush(void)
{
    RDCM_FIFOCS |= RDCM_FIFOCS_FIFOFH;
}

/*!
    \brief      enable RDCM envelope signal threshold match (API_ID(0x0027U))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[out] none
    \retval     none
*/
void rdcm_envelope_signal_threshold_match_enable(uint32_t channel)
{
    if(RDCM_CHANNEL_I == channel) {
        RDCM_CTL |= RDCM_CTL_IETHMEN;
    } else if(RDCM_CHANNEL_Q == channel) {
        RDCM_CTL |= RDCM_CTL_QETHMEN;
    } else {

    }
}

/*!
    \brief      disable RDCM envelope signal threshold match (API_ID(0x0028U))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[out] none
    \retval     none
*/
void rdcm_envelope_signal_threshold_match_disable(uint32_t channel)
{
    if(RDCM_CHANNEL_I == channel) {
        RDCM_CTL &= (~RDCM_CTL_IETHMEN);
    } else if(RDCM_CHANNEL_Q == channel) {
        RDCM_CTL &= (~RDCM_CTL_QETHMEN);
    } else {

    }
}

/*!
    \brief      enable RDCM monitor signal threshold match (API_ID(0x0029U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_monitor_signal_threshold_match_enable(void)
{
    RDCM_CTL |= RDCM_CTL_MTHMEN;
}

/*!
    \brief      disable RDCM monitor signal threshold match (API_ID(0x002AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_monitor_signal_threshold_match_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_MTHMEN);
}

/*!
    \brief      enable RDCM track error signal threshold match (API_ID(0x002BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_track_error_signal_threshold_match_enable(void)
{
    RDCM_CTL |= RDCM_CTL_TRKERRTHMEN;
}

/*!
    \brief      disable RDCM track error signal threshold match (API_ID(0x002CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_track_error_signal_threshold_match_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_TRKERRTHMEN);
}

/*!
    \brief      configure RDCM envelope signal threshold match mode (API_ID(0x002DU))
    \param[in]  i_mode: RDCM I channel threshold match mode
                only one parameter can be selected which is shown as below:
      \arg        RDCM_IETHMS_RANGE: IETHL[14:0] < I channel envelope signal value < IETHU[14:0
      \arg        RDCM_IETHMS_OUT_RANGE: I channel envelope signal value < IETHL[14:0] or IETHU[14:0] < I channel envelope signal value
      \arg        RDCM_IETHMS_GREATER: IETHL[14:0] < I channel envelope signal value
      \arg        RDCM_IETHMS_LESS: IETHL[14:0] > I channel envelope signal value
    \param[in]  q_mode: RDCM Q channel threshold match mode
                only one parameter can be selected which is shown as below:
      \arg        RDCM_QETHMS_RANGE: QETHL[14:0] < Q channel envelope signal value < QETHU[14:0
      \arg        RDCM_QETHMS_OUT_RANGE: Q channel envelope signal value < QETHL[14:0] or QETHU[14:0] < Q channel envelope signal value
      \arg        RDCM_QETHMS_GREATER: QETHL[14:0] < Q channel envelope signal value
      \arg        RDCM_QETHMS_LESS: QETHL[14:0] > Q channel envelope signal value
    \param[out] none
    \retval     none
*/
void rdcm_envelope_signal_threshold_match_mode_config(uint32_t i_mode, uint32_t q_mode)
{
    RDCM_CS &= (~(RDCM_CS_IETHMS | RDCM_CS_QETHMS));
    RDCM_CS |= ((i_mode & RDCM_CS_IETHMS) | (q_mode & RDCM_CS_QETHMS));
}

/*!
    \brief      configure RDCM monitor signal threshold match mode (API_ID(0x002EU))
    \param[in]  mode: RDCM monitor signal threshold match mode
                only one parameter can be selected which is shown as below:
      \arg       RDCM_MTHMS_OUT_RANGE: monitor signal value < MTHL[14:0] or MTHU[14:0] < monitor signal value
      \arg       RDCM_MTHMS_RANGE: MTHL[14:0] < monitor signal value < MTHU[14:0]
      \arg       RDCM_MTHMS_GREATER: MTHL[14:0] > monitor signal vibration value
      \arg       RDCM_MTHMS_LESS: MTHL[14:0] < monitor signal vibration value
    \param[out] none
    \retval     none
*/
void rdcm_monitor_signal_threshold_match_mode_config(uint32_t mode)
{
    RDCM_CS &= (~RDCM_CS_MTHMS);
    RDCM_CS |= (mode & RDCM_CS_MTHMS);
}

/*!
    \brief      configure RDCM track error signal threshold match mode (API_ID(0x002FU))
    \param[in]  mode: RDCM track error signal threshold match mode
                only one parameter can be selected which is shown as below:
      \arg       RDCM_TRKERRTHMS_RANGE: TRKERRTHL[14:0] < tracking error signal value < TRKERRTHU[14:0]
      \arg       RDCM_TRKERRTHMS_OUT_RANGE: tracking error signal value < TRKERRTHL[14:0] or TRKERRTHU[14:0] < tracking error signal value
      \arg       RDCM_TRKERRTHMS_GREATER: TRKERRTHL[14:0] < tracking error signal value
      \arg       RDCM_TRKERRTHMS_LESS: TRKERRTHL[14:0] > tracking error signal value
    \param[out] none
    \retval     none
*/
void rdcm_track_error_signal_threshold_match_mode_config(uint32_t mode)
{
    RDCM_CS &= (~RDCM_CS_TRKERRTHMS);
    RDCM_CS |= (mode & RDCM_CS_TRKERRTHMS);
}

/*!
    \brief      configure RDCM envelope signal threshold (API_ID(0x0030U))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[in]  upper: upper threshold, -16384 ~ 16383
    \param[in]  lower: lower threshold, -16384 ~ 16383
    \param[out] none
    \retval     none
*/
void rdcm_envelope_signal_threshold_config(uint32_t channel, int32_t upper, int32_t lower)
{
    if(RDCM_CHANNEL_I == channel) {
        RDCM_ETHCFG0 = ((((uint32_t)upper << 16U) & RDCM_ETHCFG0_IETHU) | ((uint32_t)lower & RDCM_ETHCFG0_IETHL));
    } else if(RDCM_CHANNEL_Q == channel) {
        RDCM_ETHCFG1 = ((((uint32_t)upper << 16U) & RDCM_ETHCFG1_QETHU) | ((uint32_t)lower & RDCM_ETHCFG1_QETHL));
    } else {

