RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_rdcm.c
    }
}

/*!
    \brief      configure RDCM monitor signal threshold (API_ID(0x0031U))
    \param[in]  upper: upper threshold, -16384 ~ 16383
    \param[in]  lower: lower threshold, -16384 ~ 16383
    \param[out] none
    \retval     none
*/
void rdcm_monitor_signal_threshold_config(int32_t upper, int32_t lower)
{
    RDCM_MTHCFG = ((((uint32_t)upper << 16U) & RDCM_MTHCFG_MTHU) | ((uint32_t)lower & RDCM_MTHCFG_MTHL));
}

/*!
    \brief      configure RDCM track error signal threshold (API_ID(0x0032U))
    \param[in]  upper: upper threshold, -16384 ~ 16383
    \param[in]  lower: lower threshold, -16384 ~ 16383
    \param[out] none
    \retval     none
*/
void rdcm_track_error_signal_threshold_config(int32_t upper, int32_t lower)
{
    RDCM_TRKERRTHCFG = ((((uint32_t)upper << 16U) & RDCM_TRKERRTHCFG_TRKERRTHU) | ((uint32_t)lower & RDCM_TRKERRTHCFG_TRKERRTHL));
}

/*!
    \brief      configure RDCM track error signal threshold match counter value (API_ID(0x0033U))
    \param[in]  cnt: the tracking error signal threshold match counter value, 0~0x3FFF
    \param[out] none
    \retval     none
*/
void rdcm_track_error_signal_threshold_match_counter_config(uint32_t cnt)
{
    RDCM_THCNT &= (~RDCM_THCNT_TRKERRTHCNT);
    RDCM_THCNT |= (cnt & RDCM_THCNT_TRKERRTHCNT);
}

/*!
    \brief      configure RDCM monitor signal threshold match counter value (API_ID(0x0034U))
    \param[in]  cnt: the monitor signal threshold match counter value, 0~0x3FFF
    \param[out] none
    \retval     none
*/
void rdcm_monitor_signal_threshold_match_counter_config(uint32_t cnt)
{
    RDCM_THCNT &= (~RDCM_THCNT_MTHCNT);
    RDCM_THCNT |= ((cnt << 16U) & RDCM_THCNT_MTHCNT);
}

/*!
    \brief      enable RDCM dma overflow detection (API_ID(0x0035U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_dma_overflow_detection_enable(void)
{
    RDCM_CTL |= RDCM_CTL_OVDEN;
}

/*!
    \brief      disable RDCM dma overflow detection (API_ID(0x0036U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rdcm_dma_overflow_detection_disable(void)
{
    RDCM_CTL &= (~RDCM_CTL_OVDEN);
}

/*!
    \brief      configure gate signal (timestamp trigger) valid level (API_ID(0x0037U))
    \param[in]  level: gate signal valid level
                only one parameter can be selected which is shown as below:
      \arg        RDCM_GATEVSEL_ALWAYS_VALID: always valid
      \arg        RDCM_GATEVSEL_HIGH_VALID: valid level is high
      \arg        RDCM_GATEVSEL_LOW_VALID: valid level is low
    \param[out] none
    \retval     none
*/
void rdcm_gate_signal_valid_level_config(uint32_t level)
{
    RDCM_CS &= (~RDCM_CS_GATEVSEL);
    RDCM_CS |= (level & RDCM_CS_GATEVSEL);
}

/*!
    \brief      configure I/Q channel data offset (API_ID(0x0038U))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[in]  offset: I/Q channel offset, -16384 ~ 16383
    \param[out] none
    \retval     none
*/
void rdcm_channel_data_offset_config(uint32_t channel, int32_t offset)
{
    if(RDCM_CHANNEL_I == channel) {
        RDCM_HFCFG0 &= (~RDCM_HFCFG0_IOFFSET);
        RDCM_HFCFG0 |= ((uint32_t)offset & RDCM_HFCFG0_IOFFSET);
    } else if(RDCM_CHANNEL_Q == channel) {
        RDCM_HFCFG1 &= (~RDCM_HFCFG1_QOFFSET);
        RDCM_HFCFG1 |= ((uint32_t)offset & RDCM_HFCFG1_QOFFSET);
    } else {

    }
}

/*!
    \brief      read I/Q channel CIC3 decimation counter (API_ID(0x0039U))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[out] none
    \retval     I/Q CIC3 decimation counter value: 0~0x1FF
*/
uint16_t rdcm_cic3_decimation_counter_read(uint32_t channel)
{
    uint16_t reval = 0U;
    if(RDCM_CHANNEL_I == channel) {
        reval = (uint16_t)(RDCM_CDCNT & RDCM_CDCNT_ICICDCNT);
    } else if(RDCM_CHANNEL_Q == channel) {
        reval = (uint16_t)((RDCM_CDCNT & RDCM_CDCNT_QCICDCNT) >> 16U);
    } else {

    }
    return reval;
}

/*!
    \brief      read I/Q channel high pass filter data (API_ID(0x003AU))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[out] none
    \retval     I/Q high pass filter output data: -32768 ~ 32767
*/
int16_t rdcm_high_pass_filter_data_read(uint32_t channel)
{
    int16_t reval = 0;
    if(RDCM_CHANNEL_I == channel) {
        reval = (int16_t)((uint16_t)(RDCM_HFDATA & RDCM_HFDATA_IHFDATA));
    } else if(RDCM_CHANNEL_Q == channel) {
        reval = (int16_t)((uint16_t)((RDCM_HFDATA & RDCM_HFDATA_QHFDATA) >> 16U));
    } else {

    }
    return reval;
}

/*!
    \brief      read I/Q channel reference frequency mixer data (API_ID(0x003BU))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[out] none
    \retval     I/Q channel reference frequency mixer output data: -32768 ~ 32767
*/
int16_t rdcm_reference_frequency_mixer_data_read(uint32_t channel)
{
    int16_t reval = 0;
    if(RDCM_CHANNEL_I == channel) {
        reval = (int16_t)((uint16_t)(RDCM_RFMDATA & RDCM_RFMDATA_IRFMDATA));
    } else if(RDCM_CHANNEL_Q == channel) {
        reval = (int16_t)((uint16_t)((RDCM_RFMDATA & RDCM_RFMDATA_QRFMDATA) >> 16U));
    } else {

    }
    return reval;
}

/*!
    \brief      read I/Q channel demodulator data (API_ID(0x003CU))
    \param[in]  channel: RDCM I/Q channel
                only one parameter can be selected which is shown as below:
      \arg        RDCM_CHANNEL_I: I channel
      \arg        RDCM_CHANNEL_Q: Q channel
    \param[out] none
    \retval     I/Q channel demodulator output data: -32768 ~ 32767
*/
int16_t rdcm_demodulator_data_read(uint32_t channel)
{
    int16_t reval = 0;
    if(RDCM_CHANNEL_I == channel) {
        reval = (int16_t)((uint16_t)(RDCM_DEMDATA & RDCM_DEMDATA_IDEMDATA));
    } else if(RDCM_CHANNEL_Q == channel) {
        reval = (int16_t)((uint16_t)((RDCM_DEMDATA & RDCM_DEMDATA_QDEMDATA) >> 16U));
    } else {

